var mbei_stateregion = `state_name:taf,state_name:mm,state_pcode,score,tier,sub1,sub2,sub3,sub4,sub5,sub6,sub7,sub8,sub9,sub10
Kachin State,ကချင်ပြည်နယ်,MMR001,60.92677307,3,5.55,6.05,7.35,8.06,6.35,5.66,6.54,5.34,6.27,4.44
Kayar State,ကယားပြည်နယ်,MMR002,64.19076538,1,6.25,5.56,7.5,8.27,7.34,3.91,6.07,5.97,6.12,5.2
Kayin State,ကရင်ပြည်နယ်,MMR003,62.69802475,1,6.94,7.03,7.66,8.41,6.58,4.89,6.22,5.12,5.82,5.16
Chin State,ချင်းပြည်နယ်,MMR004,54.83440018,4,6.74,5.73,6.68,4.12,5.76,3.63,5.43,6.12,5.84,4.31
Sagaing Region,စစ်ကိုင်းတိုင်းဒေသကြီး,MMR005,61.06163406,3,7.08,6.87,7.18,6.95,6.19,3.35,5.51,5.97,5.79,5.31
Tanintharyi Region,တနင်္သာရီတိုင်းဒေသကြီး,MMR006,64.8093338,1,5.79,7.95,6.78,8.77,6.23,3.85,6.76,5.65,6.49,5.49
Bago Region,ပဲခူးတိုင်းဒေသကြီး,MMR111,61.51213074,2,5.16,7.57,7.19,7.18,5.82,4.44,6.14,5.58,6.21,5.41
Magway Region,မကွေးတိုင်းဒေသကြီး,MMR009,62.88241959,1,6.98,6.51,7.62,8.29,6.22,4.03,6.62,5.31,6.01,4.95
Mandalay Region,မန္တလေးတိုင်းဒေသကြီး,MMR010,61.72187424,2,6.36,6.36,7.25,7.67,7.13,3.8,5.98,5.63,6.36,4.75
Mon State,မွန်ပြည်နယ်,MMR011,61.63119125,2,4.74,6.89,7.21,7.13,6.74,4.93,6.34,5.5,6.97,5.07
Rakhine State,ရခိုင်ပြည်နယ်,MMR012,55.74357605,4,6.05,7.04,6.94,7.85,5.03,5.02,5.85,4.14,6.15,4.82
Yangon Region,ရန်ကုန်ဒေသကြီး,MMR013,62.33431244,2,5.46,6.88,7.28,7.14,7.08,4.16,6.04,5.88,7.63,4.72
Shan State,ရှမ်းပြည်နယ်,MMR222,60.52116013,3,6.86,6.85,7.51,7.67,6.49,5.28,6.75,5.12,5.39,5.24
Ayawaddy Region,ဧရာဝတီတိုင်းဒေသကြီး,MMR017,58.22311783,4,6.36,7.91,6.87,5.86,5.31,3.89,6.04,4.9,6.37,5.02
Nay Pyi Taw,နေပြည်တော်,MMR018,61.08465958,3,5.88,5.92,7.62,6.16,6.59,4.19,5.93,5.81,6.43,5.04`;

var mbei_township = `township_name:taf,township_name:mm,township_pcode,score,tier,sub1,sub2,sub3,sub4,sub5,sub6,sub7,sub8,sub9,sub10
Mohnyin,မိုးညှင်း,MMR001009,62.79128265,1,6.81,7.21,7.99,8.06,5.91,4.98,6.51,5.99,6.06,4.84
Myintkyina,မြစ်ကြီးနား,MMR001003,59.88357544,1,5.19,5.56,7.09,7.95,6.41,5.89,6.47,6.1,6.35,4.33
Bhamo,ဗန်းမော်,MMR001012,61.73002625,1,5.74,6.79,8.27,8.7,6.4,5.31,6.66,5.76,6.02,4.59
Demoso,ဒီမောဆို,MMR002002,60.36486053,1,5.94,6.99,6.31,7.75,5.65,6.93,6.47,6.23,6.52,4.18
Hpruso,ဖရူဆို,MMR002003,50.88549423,1,4.47,4.3,5.11,9.78,4.43,4.36,6.5,6.39,4.97,4.47
Loikaw,လွိုင်ကော်,MMR002001,64.20127869,1,6.26,5.58,7.53,8.26,7.42,3.9,6.07,6.82,6.15,5.24
Hpa-an,ဘားအံ,MMR003001,63.18428802,1,7.17,5.67,7.44,8.51,6.39,5.15,5.98,5.97,5.79,5.38
Hpapun,ဖာပွန်,MMR003003,61.3862915,1,6.84,8.31,7.61,8.65,4.63,4.89,6.52,5.21,5.81,5.08
Myawaddy,မြဝတီ,MMR003005,62.6186409,1,6.8,8.19,7.91,8.15,7.39,4.6,6.4,5.75,5.88,4.93
Falam,ဖလမ်း,MMR004001,53.81389236,1,6.16,6.3,6.03,4.12,5.84,3.81,5.39,5.94,6.24,3.91
Hkaha,ဟားခါး,MMR004002,57.45055771,1,7.95,5.5,7.31,4.2,5.93,3.34,5.59,6.1,5.28,5.07
Debayin,ဒီပဲယင်း,MMR005010,60.36880875,1,6.87,6.61,7.29,7.66,4.72,3.1,4.78,5.57,5.66,5.64
Monywa,မုံရွာ,MMR005012,62.57052612,2,7.35,6.3,6.46,7.01,6.79,3.62,5.76,6.55,6.05,5.46
Tant Sal,တန့်ဆည်,MMR005011,59.36118317,2,6.57,6.52,7.11,6.68,5.2,3.38,5.44,6.64,5.3,4.99
Shwebo,ရွှေဘို,MMR005004,62.18137741,2,7.02,6.99,7.89,6.99,5.82,2.94,5.24,6.45,5.88,5.19
Dawei,ထားဝယ်,MMR006001,63.23939896,2,5.96,7.93,6.54,8.62,6.3,4.78,6.61,6.47,6.17,5.22
Kawt Thaung,ကော့သောင်း,MMR006009,65.19328308,2,5.94,8.09,6.94,9.01,6.33,3.64,6.85,6.37,6.54,5.62
Myeik,မြိတ်,MMR006005,64.03574371,2,6.56,8.74,6.44,7.3,5.07,3.2,6.56,7,6.21,5.7
Bago,ပဲခူး,MMR007001,56.24845123,2,4.75,6.77,6.54,6.43,6.44,3.92,6.04,6.06,5.6,4.71
Okktwin,အုတ်တွင်း,MMR007013,63.1803627,2,5.41,8.67,7.54,6.78,5.54,4.23,6.03,6.38,6.24,6.05
Phyu,ဖြူး,MMR007012,64.05486298,2,5.32,6.44,7.18,8.6,5.36,5.34,6.51,6.63,6.75,5.14
Magway,မကွေး,MMR009001,60.4509964,3,5.47,7.13,7.34,7.76,6.04,3.98,6.12,6.26,6.37,4.4
Pakokeku,ပခုက္ကူ,MMR009018,63.60749435,3,7.61,6.3,7.75,8.46,6.3,4.03,6.81,5.88,5.9,5.19
Taung Gwin Gyi,တောင်တွင်းကြီး,MMR009004,59.26774979,3,4.97,6.35,7.5,5.3,6.21,3.23,6.51,6.39,7.08,4.5
Chan Mya Tharzi,ချမ်းမြသာစည်,MMR010004,61.59840012,3,5.62,6.38,7.07,7.68,7.95,3.78,5.97,6.47,6.63,4.51
Myinchan,မြင်းခြံ,MMR010017,61.03826523,3,7.34,6.98,7.38,7.58,5.94,3.74,5.95,5.66,5.88,5.01
Pyinoolwin,ပြင်ဦးလွင်,MMR010008,63.80513,3,6.31,5.48,7.34,7.89,7.49,3.92,6,6.79,6.72,4.76
Kyauk Padaung,ကျောက်ပန်းတောင်း,MMR010020,61.0928688,3,6.34,6.35,7.7,7.55,5.81,3.7,6.51,6.01,5.25,5.69
Mawlamyaing,မော်လမြိုင်,MMR011001,64.68520355,3,5.77,7.23,7.31,7.55,7.8,4.79,6.18,6.58,7.4,4.79
Paung,ပေါင်,MMR011008,63.78055573,3,5.68,7.96,6.96,7.7,6.73,4.38,6.07,6.12,6.49,5.98
Ye,ရေး,MMR011006,59.64547348,3,4.05,6.4,7.17,6.83,6.01,5.04,6.46,5.87,6.78,5.16
Kyauk Taw,ကျောက်တော်,MMR012004,51.28362274,3,4.51,7.71,6.71,8.26,4.06,3.95,5.93,3.25,5.55,4.4
Sittwe,စစ်တွေ,MMR012001,62.51729202,3,7.3,7.2,7.32,7.68,6.07,5.01,5.76,5.47,6.12,5.51
Myauk U,မြောက်ဦး,MMR012003,52.26428986,3,5.84,8.47,6.84,8.13,4.12,3.55,5.98,3.11,5.21,4.64
Taikkyi,တိုက်ကြီး,MMR013005,65.99233246,3,5.81,6.37,7.53,7.76,6.2,4.24,6.2,6.16,7.65,5.76
Pazuntaung,ပုဇွန်တောင်,MMR013016,66.29107666,3,5.55,6.83,7.2,7.18,8.24,3.77,6.88,6.67,8.45,4.84
Hlaing Tharyar,လှိုင်သာယာ,MMR013008,61.7156868,3,5.41,7.09,7.36,7.13,6.42,4.19,5.69,5.94,7.4,4.64
Bahan,ဗဟန်း,MMR013044,62.79948044,3,4.82,6.82,7.39,6.75,8.57,4.09,6.16,6.58,7.96,4.17
South Dagon,ဒဂုံမြို့သစ်တောင်ပိုင်း,MMR013018,60.30751419,3,4.49,6.13,7.1,7.19,6.99,4.17,5.68,6,7.57,4.32
North Okkalapa,မြောက်ဥက္ကလာပ,MMR013012,68.76972198,3,7.42,7.37,7.14,7.75,7.51,4.23,5.72,6.61,7.64,5.88
Kengtung,ကျိုင်းတုံ,MMR016001,58.64800262,3,6.57,5.64,7.69,8.18,5.73,4.87,5.95,6.12,3.91,5.31
Lashio,လားရှိုး,MMR015001,63.62160492,3,7.34,6.79,7.83,7.98,6.6,5.64,6.74,5.82,5.71,5.49
Muse,မူဆယ်,MMR015009,63.32598877,3,6.96,6.03,7.19,7.65,6.99,4.41,6.36,6.37,6.17,5.25
Kunlong,ကွမ်းလုံ,MMR015020,52.72893524,3,6.56,8.67,8.28,7.15,6.46,4.27,6.74,3.86,3.53,4.71
Taunggyi,တောင်ကြီး,MMR014001,61.44614029,3,5.89,6.18,6.88,7.78,6.68,5.36,6.09,6.35,5.6,5.46
Theinni,သိန်းနီ,MMR015002,62.34004593,3,6.98,6.18,8.18,8.37,6.16,6.4,6.23,6.06,4.52,5.7
Maubin,မအူပင်,MMR017019,58.13154602,3,5.95,6.38,7.69,4.93,4.29,3.9,6.24,4.84,6.85,5.49
Wakema,ဝါးခယ်မ,MMR017017,55.90242386,3,3.51,7.97,6.56,6.97,4.83,3.63,5.98,5.2,7.14,4.29
Hinthada,ဟင်္သာတ,MMR017008,58.46607971,3,6.67,7.56,6.03,5.85,5.96,3.71,5.21,6.42,6.29,4.45
Pathein,ပုသိမ်,MMR017001,56.78159714,3,6.13,8.51,6.82,5.55,6.22,5.26,5.24,5.67,6.27,4.06
Pyapone,ဖျာပုံ,MMR017023,55.13048553,3,6.84,6.91,6.16,6.17,5.03,3.11,6.36,4.48,6.29,4.53
Lewe,လယ်ဝေး,MMR018007,58.66278458,3,3.81,7.05,7.62,6.18,5.64,4.5,5.91,6.73,6.4,3.81
Poppa Thiri,ပုဗ္ဗသီရိ,MMR018005,60.13074875,4,5.28,5.85,7.25,5.69,6.57,4.47,5.88,6.91,6.12,5.08
Pyinmana,ပျဉ်းမနား,MMR018006,61.33260345,4,6.07,5.52,7.67,6.28,6.92,3.98,5.94,6.36,6.54,4.97
Tedim,တီးတိန်,MMR004004,51.17689514,4,5.27,5.84,5.54,3.16,3.58,4.61,4.91,6.63,5.45,4.15
Taunggoke,တောင်ကုတ်,MMR012016,58.74427032,4,5.99,5.73,7.07,7.44,5.14,5.58,5.76,5.03,6.75,4.56
Latha,လသာ,MMR013036,66.5725174,4,6.24,6.66,7,7.28,8.05,3.92,7.33,6.45,7.86,5.48
Dagon Seikkan,ဒဂုံမြို့သစ်ဆိပ်ကမ်း,MMR013021,65.03288269,4,6.69,7.37,7.9,7.22,6.16,4.06,6.01,6.27,6.98,5.41
Lanmataw,လမ်းမတော်,MMR013035,67.41703796,4,6.33,6.78,7.31,7.02,8.57,4.51,7.59,6.72,7.72,5.5
Naung Cho,နောင်ချို,MMR015013,58.16705322,4,4.96,5.9,7.17,8.41,5.58,4.95,8.28,5.45,5.82,4.46
Momit,မိုးမိတ်,MMR015017,59.75886536,4,6.15,8.09,7.32,7.59,5.5,5.28,6.83,5.8,5.82,4.52
Pantanaw,ပန်းတနော်,MMR017020,58.79866028,4,6.45,8.37,7.09,5.46,4.87,3.52,6.19,6.03,5.8,5.19`;

var translationTable = `original_header,subindex_number,csv_header,subindex_name
Subindex 1: Entry Costs,1,sub1,Entry Costs
Subindex 2: Land Access & Security,2,sub2,Land Access & Security
Subindex 3: Post-Registration Regulation,3,sub3,Post-Registration Regulation
Subindex 4: Informal Charges,4,sub4,Informal Charges
Subindex 5: Infrastructure,5,sub5,Infrastructure
Subindex 6: Transparency,6,sub6,Transparency
Subindex 7: Policy Bias,7,sub7,Policy Bias
Subindex 8: Environmental Compliance,8,sub8,Environmental Compliance
Subindex 9: Labor Quality,9,sub9,Labor Quality
Subindex 10: Law & Order,10,sub10,Law & Order`;

var keyTranslations = {
  'EN' : {
    'sub1': 'Entry Costs', 'sub2': 'Land Access & Security',
    'sub3': 'Post-Registration Regulation', 'sub4': 'Informal Charges',
    'sub5': 'Infrastructure', 'sub6': 'Transparency', 'sub7': 'Policy Bias',
    'sub8': 'Environmental Compliance', 'sub9': 'Labor Quality',
    'sub10': 'Law & Order'
  },

  'MM' : {
    'sub1': 'ကနဦးကုန်ကျစရိတ်', 'sub2': 'မြေယာအသုံးချနိုင်မှုနှင့် လုံခြုံမှု',
    'sub3': 'မှတ်ပုံတင်ခြင်းအလွန် စည်းမျဉ်းစည်းကမ်းများ', 'sub4': 'အကျင့်ပျက်ခြင်းနှင့် လာဘ်စားခြင်း',
    'sub5': 'အခြေခံအဆောက်အအုံ', 'sub6': 'ပွင့်လင်းမြင်သာမှု', 'sub7': 'ယှဉ်ပြိုင်မှုတွင် ဘက်လိုက်ခြင်း',
    'sub8': 'သဘာဝပတ်ဝန်းကျင်နှင့် ကိုက်ညီမှုရှိခြင်း', 'sub9': 'အလုပ်သမားစည်းမျဉ်းစည်းကမ်းများ',
    'sub10': 'ဥပဒေနှင့်အမိန့်'
  }
};

var starburstLegend = {
  'EN' : {
    'sub1': 'Entry', 'sub2': 'Land',
    'sub3': 'Regulations', 'sub4': 'Payments',
    'sub5': 'Infrastructure', 'sub6': 'Transparency',
    'sub7': 'Favoritism', 'sub8': 'Environment',
    'sub9': 'Labor', 'sub10': 'Law'
  },

  'MM' : {
    'sub1': 'ကနဦးကုန်ကျစရိတ်', 'sub2': 'မြေယာ',
    'sub3': 'စည်းမျဉ်းစည်းကမ်း', 'sub4': 'လာဘ်စားခြင်း',
    'sub5': 'အခြေခံအဆောက်အအုံ', 'sub6': 'ပွင့်လင်းမြင်သာမှု',
    'sub7': 'ဘက်လိုက်ခြင်း', 'sub8': 'သဘာဝပတ်ဝန်းကျင်',
    'sub9': 'အလုပ်သမား', 'sub10': 'ဥပဒေနှင့်အမိန့်'
  }
};

var aboutText = {
  'EN' : `The MBEI is a comprehensive diagnostic tool that has
been specially adapted to evaluate and improve Myanmar’s
subnational business environment. To generate the index,
the Foundation surveyed nearly 5,000 businesses across
all 14 states and regions and Nay Pyi Taw Union Territory
and gather data on licensing, land access, government
transparency, and more.`,

  'MM' : `မြန်မာ့စီးပွားရေးဝန်းကျင်ညွှန်ကိန်းသည် မြန်မာနိုင်ငံ၏ ဒေသန္တရ စီးပွားရေး ပတ်ဝန်းကျင်ကို
လေ့လာ သုံးသပ်ပြီး တိုးတက်ကောင်းမွန်စေရန် အထူးလိုက်လျော ညီထွေစွာ ဖော်ဆောင်
ထားသည့် စစ်တမ်းကောက်ယူမှု အစီအစဉ် တစ်ခုဖြစ်ပါသည်။ ညွှန်းကိန်း ဖော်ထုတ်နိုင်ရန်
အတွက် အာရှဖောင်ဒေးရှင်းသည် ပြည်နယ်နှင့် တိုင်းဒေသကြီး ၁၄ ခု နှင့် နေပြည်တော်
ပြည်ထောင်စုနယ်မြေမှ လုပ်ငန်းပေါင်း ၅ဝဝဝ နီးပါးကို လိုင်စင်ပြုလုပ်ခြင်း၊ မြေယာအသုံးချ
နိုင်မှု၊ အစိုးရ၏ ပွင့်လင်းမြင်သာမှုနှင့် တခြားသော အကြောင်းအရာများနှင့် သက်ဆိုင်သည့်
အချက်အလက်များ မေးမြန်းစုဆောင်းသွားမည်ဖြစ်သည်။`
}

var copy = {
  township: {
    EN : 'Townships',
    MM : 'မြို့နယ်များ'
  },

  stateregion: {
    EN : 'States/Regions',
    MM : `တိုင်းဒေသကြီး(သို့)ပြည်နယ်များ`
  },

  about : {
    EN : `The MBEI is a comprehensive diagnostic tool that has
  been specially adapted to evaluate and improve Myanmar’s
  subnational business environment. To generate the index,
  the Foundation surveyed nearly 5,000 businesses across
  all 14 states and regions and Nay Pyi Taw Union Territory
  and gather data on licensing, land access, government
  transparency, and more.`,

    MM : `မြန်မာ့စီးပွားရေးဝန်းကျင်ညွှန်ကိန်းသည် မြန်မာနိုင်ငံ၏ ဒေသန္တရ စီးပွားရေး ပတ်ဝန်းကျင်ကို
  လေ့လာ သုံးသပ်ပြီး တိုးတက်ကောင်းမွန်စေရန် အထူးလိုက်လျော ညီထွေစွာ ဖော်ဆောင်
  ထားသည့် စစ်တမ်းကောက်ယူမှု အစီအစဉ် တစ်ခုဖြစ်ပါသည်။ ညွှန်းကိန်း ဖော်ထုတ်နိုင်ရန်
  အတွက် အာရှဖောင်ဒေးရှင်းသည် ပြည်နယ်နှင့် တိုင်းဒေသကြီး ၁၄ ခု နှင့် နေပြည်တော်
  ပြည်ထောင်စုနယ်မြေမှ လုပ်ငန်းပေါင်း ၅ဝဝဝ နီးပါးကို လိုင်စင်ပြုလုပ်ခြင်း၊ မြေယာအသုံးချ
  နိုင်မှု၊ အစိုးရ၏ ပွင့်လင်းမြင်သာမှုနှင့် တခြားသော အကြောင်းအရာများနှင့် သက်ဆိုင်သည့်
  အချက်အလက်များ မေးမြန်းစုဆောင်းသွားမည်ဖြစ်သည်။`
},

  medianStarburst: {
    EN : 'Median National Subindex Scores',
    MM : `နိုင်ငံလုံးဆိုင်ရာ အညွှန်းခွဲရမှတ်များ
    (အလယ်ဗဟိုလ်ကိန်းဂဏန်း)`
  },

  nationalRankings: {
    EN : 'National MBEI Rankings',
    MM : `တိုင်းဒေသကြီးနှင့်ပြည်နယ်များ၏ အဆင့်လိုက်ညွှန်းကိန်းရမှတ်များ`
  }
}

var starburstIcon = { 'sub1': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon1.png',
'sub2': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon2.png',
'sub3': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon3.png',
'sub4': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon4.png',
'sub5': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon5.png',
'sub6': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon6.png',
'sub7': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon7.png',
'sub8': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon8.png',
'sub9': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon9.png',
'sub10': 'https://opendevelopmentmyanmar.net/wp-content/uploads/sites/4/2019/04/icon10.png'};
