var candidateList = `မဲဆန္ဒနယ်,မြို့နယ်,Township,မြို့တော်ကော်မတီ၀င်,မြို့နယ်ဥက္ကဋ္ဌ,မြို့နယ်အဖွဲ့၀င် (၁),မြို့နယ်အဖွဲ့၀င် (၂),NLD ပါတီ၀င် ဦးရေ,USDP ပါတီ၀င် ဦးရေ,တစ်သီးပုဂ္ဂလ ဦးရေ
မဲဆန္ဒနယ်အမှတ် ၁,တောင်ဥက္ကလာပ,North Okkalapa,ဦးအောင်ကျော်မိုး,"ဦးကျော်ဇေယျာဝင်း(NLD),ဒေါ်လေးရည်အောင်,ဦးအောင်မော်ငြိမ်း","ဒေါ်ခင်ခင်ထွေး,ဦးလင်းထက်(NLD),ဦးသန်းဌေး","ဒေါ်သီရိဇော်(NLD),ဦးအောင်သန်းဦး",၃,,၆
မဲဆန္ဒနယ်အမှတ် ၁,မြောက်ဥက္ကလာပ,South Okkalapa,ဦးဇော်သန့်,"ဦးသန်းထွဋ်,ဦးသန်းဝင်း,ဦးသန်းဦး(USDP),ဦးအောင်ကျော်မိုး,ဦးအောင်ဇေ(ခ)ဦးအောင်ဇေမိုး(NLD)","ဦးမင်းလွင်(USDP),ဦးရဲဆင့်","ဦးစိုးမင်းဦး,ဒေါ်နုနုလွင်(NLD),ဦးမြင့်လွင်,ဦးလှမိုး,ဦးအေးမင်းဇော်(USDP)",၂,၃,၈
မဲဆန္ဒနယ်အမှတ် ၁,သင်္ဃန်းကျွန်း,Thingangyun,ဦးဝင်းမြင့်သန်း(NLD),"ဦးအေးမင်း(NLD),ဦးအုန်းထွန်း",ဦးကြည်ဝင်း(NLD),"ဦးကိုကိုနိုင်,ဦးမင်းသိန်းဦး(NLD)",၄,,၂
မဲဆန္ဒနယ်အမှတ် ၂,ဒဂုံမြို့သစ်(တောင်ပိုင်း),Dagon Myothit (South),ဦးသူရအောင်(NLD),"ဦးမြကွန်း,ဦးမင်းမင်းလတ်(NLD)","ဦးကျော်စွာဦး,ဦးထိန်လင်း(NLD)","ဒေါ်ငွေသိန်း,ဒေါ်နှင်းဝတ်ရည်(NLD),ဦးမင်းခိုင်,ဦးသန့်ဇော်မိုး",၄,,၅
မဲဆန္ဒနယ်အမှတ် ၂,ဒဂုံမြို့သစ်(မြောက်ပိုင်း),Dagon Myothit (North),,"ဒေါ်မေသင်္ကြန်ထွန်း,ဦးမြင့်ဇော်,ဦးအာကာအောင်(NLD)","ဦးဇောကျော်အောင်(NLD),ဦးပြည်သာကျော်,ဦးသန်းအောင်မိုး","ဒေါ်ခင်စန်းဝင်း(NLD),ဦးဇော်ဝင်းမြင့်,ဦးအောင်ကျော်ဇော်",၃,,၆
မဲဆန္ဒနယ်အမှတ် ၂,ဒဂုံမြို့သစ်(အရှေ့ပိုင်း),Dagon Myothit (East),ဦးအောင်ဆန်းလင်း,"ဦးအောင်နိုင်ထွန်း(NLD),ဦးအောင်မျိုးသန့်(ခ)ပြုံးချို","ဦးမျိုးဆွေ(NLD),ဦးဟန်ဇော်ဦး","ဦးစည်သူဇော်,ဦးနေလ(ခ)ထွန်းထွန်းဝင်း(NLD),ဦးသိန်းဝင်း(ခ)အိရှောင်",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၂,ဒဂုံမြို့သစ်(ဆိပ်ကမ်း),Dagon Myothit (Seikkan),,"ဦးကျော်ဝင်း(NLD),ဦးခင်ဝင်း(USDP)","ဦးကျော်သူအောင်(NLD),ဦးခင်မောင်ဇင်,ဒေါ်ခင်လေးမြင့်(USDP),ဦးတင်ဇော်လေး",ဦးဇော်တင်,၂,၂,၃
မဲဆန္ဒနယ်အမှတ် ၃,လမ်းမတော်,Lanmadaw,ဦးလပ်သင်း,"ဦးနေလင်းအောင်,ဦးဝင်းမြင့်(NLD),ဦးသန်းညွှန့်,ဦးသိန်းထွန်း","ဦးကျော်မင်းထိုက်,ဦးစိုးမင်းသူ(NLD)","ဦးတင်အေးချို,ဦးနေလင်းထွန်း(NLD),ဦးသန့်ဇော်",၃,,၇
မဲဆန္ဒနယ်အမှတ် ၃,လသာ,Latha,"ဦးကျော်စိုးထွဋ်,ဒေါ်ထက်ထက်ထွန်း",ဦးကျော်စိုးအောင်(NLD),"ဦးဇော်မင်းနိုင်,ဦးသောင်းတိုး(NLD)",ဒေါ်ချိုချိုဝင်း(NLD),၃,,၃
မဲဆန္ဒနယ်အမှတ် ၃,ဒဂုံ,Dagon,"ဦးစိုးလွင်(NLD),ဦးဝင်းချို","ဦးကျော်စိုးမိုး,ဦးစိုင်းကျော်သူရထွန်း,ဦးသိန်းဦး(NLD),ဦးအောင်ကျော်ဦး",ဒေါ်မေမြင့်သူ,"ဦးနိုင်ထွန်းဦး,ဒေါ်ရတနာနွယ်ဦး",၂,,၇
မဲဆန္ဒနယ်အမှတ် ၃,စမ်းချောင်း,Sanchaung,ဦးအောင်ခန့်,"ဦးဇော်မြင့်,ဦးနေမျိုးအောင်ကိုကို,ဦးပုည(NLD)","ဦးကျော်ဇင်ဆိုင်း,ဦးညီညီမြင့်မြတ်(NLD)","ဦးကြည်အောင်,ဒေါ်တိုးတိုးအောင်(NLD)",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၃,အလုံ,Ahlone,ဦးနေလင်းဇင်,ဦးစန်းလွင်(NLD),"ဒေါ်ထွေးထွေးစော,ဦးပြည့်ဖြိုးအောင်","ဒေါ်မြတ်စိုးထိုက်,ဦးသန်းဝင်း",၁,,၅
မဲဆန္ဒနယ်အမှတ် ၃,ရန်ကင်း,Yankin,,"ဦးတင်မိုးအောင်(ခ)နေရှိုင်း,ဦးနန်းဦး,ဦးအေးကျော်လွင်,ဦးအောင်မင်းမင်းကို(NLD)","ဒေါ်တင်တင်အောင်(NLD),ဦးမြင့်ဇော်",ဦးတင်ထွန်း,၂,,၅
မဲဆန္ဒနယ်အမှတ် ၃,တာမွေ,Tamwe,,"ဦးသန်းထွန်း,ဦးသန်းဝင်း,ဦးအောင်မျိုးလင်း(NLD)","ဦးကြူလွင်,ဒေါ်ခိုင်မာသင်း(NLD)","ဦးငွေတိုး,ဦးညီညီစိုး(NLD),ဦးမြင့်ထွေး",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၃,ကမာရွတ်,Kamaryut,ဦးခင်မောင်လွင်,"ဦးဇော်ဇော်မြင့်မောင်,ဦးမြင့်စိန်,ဦးမြင့်အောင်,ဒေါ်သန်းသန်းဌေး(NLD)","ဒေါ်ခင်ခင်ချို(NLD),ဦးသန်းဇော်","ဦးခင်မောင်ထွန်း,ဦးနေထွန်းအောင်,ဒေါ်မာလာမြင့်",၂,,၈
မဲဆန္ဒနယ်အမှတ် ၃,ဗဟန်း,Bahan,"ဦးခင်လှိုင်,ဦးမြင့်ကြည်","ဦးဖေတိုက်အောင်,ဦးဝင်းဗိုလ်(NLD)","ဦးညိုဝင်း,ဦးမြင့်သန်း(NLD)",ဦးကျော်ဆန်းဦး,၂,,၅
မဲဆန္ဒနယ်အမှတ် ၃,ဆိပ်ကမ်း,Seikkan,,"ဦးရွှေသန်း,ဦးလှသန်း,ဒေါ်အေးယုမော်(NLD)","ဒေါ်ခင်စန်းဌေး,ဦးစိုးနိုင်","ဒေါ်ရီရီခိုင်,ဒေါ်ဝင်းဝင်းလှိုင်",၁,,၆
မဲဆန္ဒနယ်အမှတ် ၃,ပန်းဘဲတန်း,Pabedan,,"ဦးဇော်ဝင်းထူး(NLD),ဒေါ်မို့မို့အောင်,ဒေါ်မျိုးသိင်္ဂီဝင်း","ဦးစိုးနိုင်ထွန်း(NLD),ဦးညိုဝင်း","ဒေါ်စုစုကြည်,ဒေါ်စိုးစိုးရွှေ(NLD)",၃,,၄
မဲဆန္ဒနယ်အမှတ် ၃,ကြည့်မြင်တိုင်,Kyeemyindaing,,"ဦးကျော်ဇေယျာမြင့်,ဦးတင်စိန်(A),ဦးတင်စိန်(B),ဦးအောင်ကျော်စိုး(NLD)",ဦးထွန်းညွန့်,ဦးလှမျိုးထွန်း(ခ)ဖြူလေး,၁,,၅
မဲဆန္ဒနယ်အမှတ် ၄,မင်္ဂလာတောင်ညွန့်,Mingalartaungnyunt,ဦးလှမျိုးမြင့်,"ဦးခင်မောင်လင်း(USDP),ဦးခင်လှိုင်(NLD),ဦးဌေးမြင့်,ဦးရဲမင်းဌေး,ဦးအောင်ကျော်စိုး","ဦးဗိုလ်ဗိုလ်ခင်မောင်တင့်,ဒေါ်သီသီခိုင်(NLD),ဦးအောင်ထိန်လင်း(USDP)","ဦးတင်ရှိန်(USDP),ဦးမင်းအောင်(NLD),ဦးဝင်းနိုင်",၃,၃,၆
မဲဆန္ဒနယ်အမှတ် ၄,ဒလ,Dala,,"ဒေါ်မြင့်မြင့်ကြည်(NLD),ဦးသိန်းထွန်း(USDP)","ဦးကျော်လင်း(NLD),ဦးသန့်ဇင်(USDP)","ဒေါ်ဆွေဆွေဝင်း(USDP),ဦးဇော်မိုး(NLD)",၃,၃,
မဲဆန္ဒနယ်အမှတ် ၄,ဗိုလ်တထောင်,Botahtaung,"ဦးမျိုးမြင့်,ဦးမျိုးသော်","ဒေါ်ခင်နီလာအောင်(NLD),ဒေါ်မိမိအောင်","ဦးညီညီဟန်,ဒေါ်လဲ့လဲ့မင်း(NLD),ဦးသိန်းသန်းထွန်း","ဒေါ်နွယ်နီဝင်း(NLD),ဦးအောင်ခင်ချို",၃,,၆
မဲဆန္ဒနယ်အမှတ် ၄,ဆိပ်ကြီးခနောင်တို,Seikgyikanaungto,,"ဦးကိုကိုလေး,ဦးဇော်ဝင်း(NLD),ဦးဝင်းမြင့်(USDP),ဦးမောင်မောင်သာ,ဦးသန်းနွဲ့","ဦးတင်ဟန်(USDP),ဦးသက်မြင့်ဝင်း,ဦးအောင်ငြိမ်းချမ်း(NLD)","ဦးလှမောင်(USDP),ဦးဇော်ဇော်ဦး(NLD)",၃,၃,၄
မဲဆန္ဒနယ်အမှတ် ၄,ကျောက်တံတား,Kyauktada,,"ဦးကိုကိုမော်,ဦးကျော်စွာဝင်း(NLD),ဦးသိန်းနိုင်","ဦးသိန်းထွန်း(ခ)ဦးသိန်းဇော်,ဦးဟန်စိုးမင်း(NLD)",ဦးကိုကိုနိုင်,၂,,၄
မဲဆန္ဒနယ်အမှတ် ၄,ပုဇွန်တောင်,Pazundaung,ဦးစိန်အုန်း(NLD),"ဦးမောင်မောင်မြင့်(USDP),ဦးမြင့်မြတ်သူ(NLD)","ဦးကျော်ကျော်ဦး(USDP),ဦးဇင်ဇင်မင်းကျော်,ဦးမင်းဇော်(NLD)",ဦးညီညီအောင်,၄,၂,၁
မဲဆန္ဒနယ်အမှတ် ၄,ဒေါပုံ,Dawbon,,"ဦးခင်မောင်လင်း,ဦးစိုးဝင်း,ဦးဘိုဘိုဇော်(NLD),ဦးသက်နိုင်","ဦးမြင့်ဆွေ,ဦးမင်းမောင်မောင်(NLD)","ဦးဝင်းလှိုင်,ဦးသက်နိုင်ဦး(NLD)",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၄,သာကေတ,Thaketa,ဦးအောင်အောင်,"ဦးဝင်းနိုင်,ဦးအောင်ငြိမ်းကျော်(NLD),ဦးအောင်မင်း","ဦးသူရဇော်(NLD),ဦးအောင်ဆန်းထွန်း(ခ)တိုးတိုး","ဦးမင်းမင်းထွန်း,ဒေါ်မေသန္တာလှိုင်(NLD)",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၅,အင်းစိန်,Insein,"ဦးစိုးမင်းဦး,ဦးထင်အောင်ကျော်ထက်","ဦးတင်ဦး,ဦးမောင်မောင်ဇင်,ဦးသိန်းသန်း(NLD)","ဦးကျော်နိုင်,ဦးလင်းအောင်ဟိန်း(NLD),ဦးဝင်းဗိုလ်,ဦးအောင်မင်းထွေး","ဦးစိုးလွင်(NLD),ဦးအောင်ဇော်မိုး,ဦးအောင်နိုင်ထွန်း",၃,,၉
မဲဆန္ဒနယ်အမှတ် ၅,လှိုင်သာယာ,Hlaingtharya,"ဦးကြည်စိုး,နန့်စုရွှေစင်(ခ)မဝိုင်း(NLD)","ဦးစိုးသိန်းအောင်(NLD),ဦးသောင်းလှိုင်(USDP)","ဒေါ်ခင်နှင်းယု(NLD),ဦးစိုင်းလင်းဇော်(USDP),ဦးမောင်ကြီး","ဦးဇော်အောင်(ခ)ဦးစိမ်းမောင်(NLD),ဦးနေလင်းဦး(ခ)ဦးကျော်ရဲအောင်,ဦးလေးနိုင်(USDP)",၄,၃,၃
မဲဆန္ဒနယ်အမှတ် ၆,မရမ်းကုန်း,Mayangone,ဦးမင်းဟန်(NLD),"ဦးကျော်မင်းဦး,Dr.ကျော်သန်းထိုက်,ဦးစိန်ထွန်း(NLD),ဦးမြင့်အောင်ထွန်း",ဦးကျော်ဇင်လင်း,"ဒေါ်ခင်ချိုမြင့်,ဒေါ်မိုင်နှင်းဝတ်ရည်(NLD)",၃,,၅
မဲဆန္ဒနယ်အမှတ် ၆,လှိုင်,Hlaing,,"ဦးစိုးဦး,ဦးဖေစိုး(NLD),ဦးမျိုးဝင်း,ဦးသိန်းစိုး","ဦးမောင်စန်း,ဦးရန်နိုင်သန်း,ဒေါ်သန်းသန်းဆင့်(NLD)","ဦးသန့်ဇင်လတ်(NLD),ဦးအုန်းဌေး",၃,,၆
မဲဆန္ဒနယ်အမှတ် ၆,မင်္ဂလာဒုံ,Mingaladon,"ဦးခင်မောင်တင့်(USDP),ဦးဇော်ဇော်","ဒေါ်ကြည်ကြည်ဝေ(NLD),ဦးတင့်ထူး,ဦးထွန်းထွန်းဦး,ဦးအောင်ကျော်ဦး(USDP)","ဦးထွန်းညွန့်ရွှေ(USDP),ဦးအောင်ကျော်ထွန်း(NLD)","ဦးဝင်းသန်း(USDP),ဦးသန်းနိုင်စိုး(NLD)",၃,၄,၃
မဲဆန္ဒနယ်အမှတ် ၆,ရွှေပြည်သာ,Shwepyithar,,"ဦးသိန်းနိုင်,ဦးသိန်းဇံ(NLD)","ဦးမောင်မောင်ညွန့်,ဦးသီဟသူ(NLD)","ဦးဝင်းအောင်,ဦးသိန်းထိုက်(NLD)",၃,,`;
